using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace WindowsFormsApp1
{
    public partial class Form1 : Form
    {
        public Form1()
        {
            InitializeComponent();
        }

        private void textBox1_TextChanged(object sender, EventArgs e)
        {
            string input = textBox1.Text;

            if (input == "F12")
            {
                label5.Text = "    F12 - Розлади, пов'язані з каннабісом" +
                    "\n" +
                    "\n    Надмірне вживання марихуани з пов’язаними психологічними симптомами та порушенням соціального чи професійного функціонування." +
                    "\n" +
                    "\n    Марихуана - це суха, подрібнена суміш квітів, стебел, насіння та листя рослини конопель Cannabis sativa. Зазвичай люди курять його як сигарету або в трубці. Це незаконний наркотик, яким найчастіше зловживають у Сполучених Штатах. Зловживання марихуаною може призвести до проблем із пам’яттю, навчанням і соціальною поведінкою. Це може заважати родині, школі, роботі та іншим заняттям. Тривають наукові дослідження, щоб перевірити безпечність і корисність сполук канабісу для лікування певних захворювань. В даний час куріння марихуани не рекомендується для лікування будь-яких захворювань або станів.";
            }
            if (input == "F20")
            {
                label5.Text = "    F20 - Шизофренія" +
                    "\n" +
                    "\n    Шизофренічні розлади характеризуються загалом фундаментальними та характерними спотвореннями мислення та сприйняття, а також афектами, які є неадекватними або притупленими. Ясна свідомість і інтелектуальна здатність зазвичай зберігаються, хоча певні когнітивні дефіцити можуть розвиватися з часом. До найважливіших психопатологічних явищ належать відлуння думки; вставка або відмова від думки; трансляція думки; маячне сприйняття та марення контролю; вплив або пасивність; галюцинаторні голоси, що коментують або обговорюють пацієнта від третьої особи; розлади мислення і негативні симптоми." +
                    "\n" +
                    "\n    Перебіг шизофренічних розладів може бути або безперервним, або епізодичним з прогресуючим або стійким дефіцитом, або може мати місце один або кілька епізодів з повною або неповною ремісією. Діагноз шизофренії не слід встановлювати за наявності виражених депресивних або маніакальних симптомів, якщо тільки не ясно, що шизофренічні симптоми передували афективному розладу. Також не слід діагностувати шизофренію за наявності явного захворювання головного мозку або під час станів наркотичного сп’яніння чи абстиненції. Подібні розлади, що розвиваються при наявності епілепсії чи іншого захворювання головного мозку, слід класифікувати під F06.2, а спричинені психоактивними речовинами під F10-F19 із загальним четвертим знаком .5.";
            }
            if (input == "F21")
            {
                label5.Text = "    F21 - Шизотиповий розлад" +
                    "\n" +
                    "\n    Розлад, що характеризується ексцентричною поведінкою та аномаліями мислення та афекту, які нагадують ті, що спостерігаються при шизофренії, хоча на будь-якій стадії не виникає певних і характерних шизофренічних аномалій. Симптоми можуть включати застуду або неадекватний вплив; ангедонія; дивна або ексцентрична поведінка; схильність до соціальної самоізоляції; параноїдальні або химерні ідеї, які не є справжніми ілюзіями; нав'язливі роздуми; розлад мислення та порушення сприйняття; випадкові транзиторні квазіпсихотичні епізоди з інтенсивними ілюзіями, слуховими або іншими галюцинаціями та маревними ідеями, які зазвичай виникають без зовнішньої провокації. Немає чіткого початку, а еволюція та перебіг зазвичай є розладом особистості.";
            }
            else if ((input != "F12") && (input != "F20") && (input != "F21"))
            {
                label5.Text = "Інформація не додана.";
            }
        }

        private void Form1_Load(object sender, EventArgs e)
        {
            label5.AutoSize = true; // Включаємо автоматичну зміну розміру Label
            label5.MaximumSize = new System.Drawing.Size(750, 0); // Вказуємо максимальну ширину для перенесення тексту
        }
    }
}
